hejhog/app/controllers/api/v1/base_urls_controller.rb

  def index
    base_urls = BaseUrl.all
---
SELECT "base_urls".* FROM "base_urls"

  def create
    base_url = BaseUrl.create(base_url_params)
---
INSERT INTO "base_urls" ("site_name", "base_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["site_name", "My Api"], ["base_url", "Test"], ["created_at", "2017-05-31 20:17:53.734166"], ["updated_at", "2017-05-31 20:17:53.734166"]]

  def show
    url = BaseUrl.find(params[:id])
---
SELECT  "base_urls".* FROM "base_urls" WHERE "base_urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]