hejhog/app/controllers/api/v1/main_paths_controller.rb

  def index
    main_paths = MainPath.all
---
SELECT "main_paths".* FROM "main_paths"

  def create
    main_path = MainPath.create(main_path_params)
---
INSERT INTO "main_paths" ("main_branch", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["main_branch", "evolution-chain"], ["created_at", "2017-05-31 22:03:40.141996"], ["updated_at", "2017-05-31 22:03:40.141996"]]